uhnp/src/Documents/ПереводНаРаботуСКоронавирусом/ПереводНаРаботуСКоронавирусом.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПереводНаРаботуСКоронавирусом</name>
  <registerRecords>InformationRegister.ПериодыРаботыСКоронавирусом</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>НачалоПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОкончаниеПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КраткийСоставДокумента</name>
    <comment>Краткий перечень сотрудников, включенных в документ</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>РазныеСрокиДляРазныхСотрудников</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ФизическиеЛица</name>
    <attributes>
      <name>ФизическоеЛицо</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Сотрудники</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

uhnp/src/InformationRegisters/ПериодыРаботыСКоронавирусом/ПериодыРаботыСКоронавирусом.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПериодыРаботыСКоронавирусом</name>
  <writeMode>RecorderSubordinate</writeMode>
  <dimensions>
    <name>ФизическоеЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/Enums/ПолучательСтимулирующихВыплатФСС/ПолучательСтимулирующихВыплатФСС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ПолучательСтимулирующихВыплатФСС</name>
  <enumValues>
    <name>МедицинскаяОрганизация</name>
  </enumValues>
  <enumValues>
    <name>ОрганизацияСоциальногоОбслуживания</name>
  </enumValues>
  <enumValues>
    <name>ТерриториальныйОрганФедеральныйГосОргана</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/Documents/ПереводНаРаботуСКоронавирусом/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	ПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	ДанныеДляПроведения = ДанныеДляПроведения();
	СформироватьДвиженияПериодовРаботыСКоронавирусом(Движения, ДанныеДляПроведения.ПериодыРаботыСКоронавирусом);
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	ИсключаемыеРеквизиты = Новый Массив;
	НастройкиКадровогоУчета = КадровыйУчет.НастройкиКадровогоУчета();
	
	Если НастройкиКадровогоУчета.ПолучательСтимулирующихВыплатФСС = Перечисления.ПолучательСтимулирующихВыплатФСС.МедицинскаяОрганизация Тогда
		ИсключаемыеРеквизиты.Добавить("Сотрудники.ДатаНачала");
		ИсключаемыеРеквизиты.Добавить("Сотрудники.ДатаОкончания");
	КонецЕсли;
	
	ЗарплатаКадры.ПроверитьКорректностьДаты(Ссылка, НачалоПериода, "Объект.НачалоПериода", Отказ, НСтр("ru = 'Начало периода';
																										|en = 'Period start'"), , , Ложь);
	
	Если ЗначениеЗаполнено(ОкончаниеПериода) И ОкончаниеПериода < НачалоПериода Тогда
		
		ТекстСообщения = НСтр("ru = 'Не верно задано окончание периода';
								|en = 'Period end is specified incorrectly'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, Ссылка, "Объект.ОкончаниеПериода", , Отказ);
		
	КонецЕсли;
	
	КадровыйУчет.ПроверитьРаботающихСотрудниковТабличнойЧастиДокумента(ЭтотОбъект, "Сотрудники", "ДатаНачала", "ДатаОкончания", Отказ);
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, ИсключаемыеРеквизиты);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ДанныеДляПроведения()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ПереводНаРаботуСКоронавирусомСотрудники.ДатаНачала КАК ДатаНачала,
		|	ПереводНаРаботуСКоронавирусомСотрудники.ДатаОкончания КАК ДатаОкончания,
		|	ПереводНаРаботуСКоронавирусомСотрудники.Сотрудник КАК Сотрудник,
		|	ПереводНаРаботуСКоронавирусомСотрудники.Сотрудник.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ПереводНаРаботуСКоронавирусомСотрудники.Ссылка.Организация КАК Организация
		|ИЗ
		|	Документ.ПереводНаРаботуСКоронавирусом.Сотрудники КАК ПереводНаРаботуСКоронавирусомСотрудники
		|ГДЕ
		|	ПереводНаРаботуСКоронавирусомСотрудники.Ссылка = &Ссылка";
	
	ПериодыРаботыСКоронавирусом = Запрос.Выполнить().Выгрузить();
	Данные = Новый Структура("ПериодыРаботыСКоронавирусом", ПериодыРаботыСКоронавирусом);
	
	Возврат Данные;
	
КонецФункции

Процедура СформироватьДвиженияПериодовРаботыСКоронавирусом(Движения, ПериодыРаботыСКоронавирусом)
	Если ПериодыРаботыСКоронавирусом.Количество() > 0 Тогда
		
		Движения.ПериодыРаботыСКоронавирусом.Загрузить(ПериодыРаботыСКоронавирусом);
		Движения.ПериодыРаботыСКоронавирусом.Записывать = Истина;
		
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
						|en = 'Invalid object call on the client.'");
#КонецЕсли
